bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
static rt_mq_t fprint_mq;
static rt_sem_t s_fprint;

//fprint output data API
static fprint_call_back 	fprintf_ok_fun = RT_NULL;
static fprint_call_back 	fprintf_error_fun = RT_NULL;
static fprint_call_back 	fprintf_null_fun = RT_NULL;

void fp_ok_callback(fprint_call_back fun)
{
	if(fun != RT_NULL)
	{
		fprintf_ok_fun = fun;
	}
}

void fp_error_callback(fprint_call_back fun)
{
	if(fun != RT_NULL)
	{
		fprintf_error_fun = fun;
	}
}

void fp_null_callback(fprint_call_back fun)
{
	if(fun != RT_NULL)
	{
		fprintf_null_fun = fun;
	}
}


static uint16_t
check_sum(uint8_t *frame, uint16_t len)
{
	uint16_t i;
	uint16_t cs = 0;

	for (i = 0; i < len; i++) {
		cs += *(frame + i);
	}

	return cs;
}

__STATIC_INLINE void
reverse(uint8_t *dst, uint8_t *src, uint8_t len)
{
    if (len)
        src += len - 1;
    else
        return;

    while (len-- > 0)
    {
        *dst++ = *src--;
    }
}

static void
fprint_reset(void)
{
}


__STATIC_INLINE FPRINT_ERROR_TYPEDEF
fprint_frame_send(uint8_t cmd, FPRINT_FRAME_HEAD_TYPEDEF *frame_head,
                    FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length, data_offset;
	FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;

	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		return error;

	rt_device_control(fprint_device, RT_DEVICE_CTRL_CLR_RB, RT_NULL);

    data_offset = 0;
    data_length = 0;


    switch (cmd)
    {
        case FPRINT_FRAME_CMD_VERIFY:
            {
                req_data->req_verify.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_verify) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_EMPTY:
            {
                req_data->req_empty.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_empty) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_SET_PARAM:
            {
                req_data->req_set_param.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_set_param) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_SET_ADDR:
            {
                req_data->req_set_addr.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_set_addr) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_GET_IMAGE:
            {
                req_data->req_get_image.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_get_image) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_GENERATE:
            {
                req_data->req_generate.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_generate) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_MERGE:
            {
                req_data->req_merge.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_merge) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_UP_CHAR:
            {
                req_data->req_up_char.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_up_char) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_DOWN_CHAR:
            {
                req_data->req_up_char.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_down_char) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_LOAD_CHAR:
            {
                req_data->req_load_char.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_load_char) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_STORE_CHAR:
            {
                req_data->req_store_char.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_store_char) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_DEL_CHAR:
            {
                req_data->req_del_char.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_del_char) + 2;
                break;
            }
        case FPRINT_FRAME_CMD_SEARCH:
            {
                req_data->req_search.cmd = cmd;
                data_offset = 0;
                data_length = sizeof(req_data->req_search) + 2;
                break;
            }
        default :
            {
                goto error_process;
            }
    }

    reverse(frame_head->len, (uint8_t *)&data_length, 2);
    data_length -= 2;
	cs = check_sum((uint8_t *)frame_head+6, sizeof(*frame_head)-6) + check_sum((uint8_t *)req_data + data_offset, data_length);
	error = FPRINT_EOK;
	rt_device_write(fprint_device, 0, frame_head, sizeof(*frame_head));
	rt_device_write(fprint_device, 0, req_data + data_offset, data_length);
    cs = __REV16(cs);
	rt_device_write(fprint_device, 0, &cs, 2);

#if (defined RT_USING_FINSH) && (FPRINT_DEBUG == 1)
	rt_kprintf("\nfprint send :---------------------\n");
	print_hex((uint8_t *)frame_head, sizeof(*frame_head));
	print_hex((uint8_t *)req_data + data_offset, data_length);
	print_hex((uint8_t *)&cs, sizeof(cs));
	rt_kprintf("------------------------------------\n");
#endif // RT_USING_FINSH

error_process:
	return error;
}

#define offsetof(TYPE, MEMBER) ((size_t) &((TYPE *)0)->MEMBER)

__STATIC_INLINE uint16_t
fprint_frame_recv_data(uint8_t *buf, uint16_t size)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length, data_offset;
    uint16_t check = 0;
	rt_size_t recv_cnts;
	FPRINT_ERROR_TYPEDEF error;
	uint8_t cnts;
    FPRINT_FRAME_HEAD_TYPEDEF head;

    data_length = 0;
    data_offset = 0;

	error = FPRINT_EERROR;


	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
    while (size > 0)
    {
        for (cnts = 0; cnts < 20; cnts++) {
            rt_thread_delay(20);
            recv_cnts = rt_device_read(fprint_device, 0, &head, sizeof(head));
            if (recv_cnts != sizeof(head)) {
                if (recv_cnts == 0) {
                    error = FPRINT_ERESPONSE;
                    continue;
                } else {
                    error = FPRINT_EERROR;
                    goto error_process;
                }
            } else {
                error = FPRINT_EERROR;
                break;
            }
        }

