bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
	rt_memset(&head, 0, sizeof(head));

	reverse(head.start, (uint8_t *)&start, sizeof(start));
    reverse(head.addr, (uint8_t *)&addr, sizeof(addr));

    head.pid = FPRINT_FRAME_PID_CMD;

	error = fprint_frame_send(cmd, &head, req_data);
	if (error != FPRINT_EOK)
		goto process_error;
    //rt_thread_delay(50);
	error = fprint_frame_recv(cmd, &head, rep_data);
	if (error != FPRINT_EOK)
		goto process_error;

    error = FPRINT_EERROR;
    switch (cmd)
    {
        case FPRINT_FRAME_CMD_VERIFY:
            {
                if (rep_data->rep_verify.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_EMPTY:
            {
                if (rep_data->rep_empty.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_SET_PARAM:
            {
                if (rep_data->rep_set_param.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_SET_ADDR:
            {
                if (rep_data->rep_set_addr.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_GET_IMAGE:
            {
                if (rep_data->rep_get_image.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                else if (rep_data->rep_get_image.result == FPRINT_FRAME_ERR_FP_NOT_DETECTED)
                    error = FPRINT_ENO_DETECTED;
                break;
            }
        case FPRINT_FRAME_CMD_GENERATE:
            {
                if (rep_data->rep_generate.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_MERGE:
            {
                if (rep_data->rep_merge.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_UP_CHAR:
            {
                if (rep_data->rep_up_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_DOWN_CHAR:
            {
                if (rep_data->rep_down_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_LOAD_CHAR:
            {
                if (rep_data->rep_load_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_STORE_CHAR:
            {
                if (rep_data->rep_store_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_DEL_CHAR:
            {
                if (rep_data->rep_del_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_SEARCH:
            {
                if (rep_data->rep_search.result == FPRINT_FRAME_ERR_SUCCESS || rep_data->rep_search.result == FPRINT_FRAME_ERR_NO_SEARCH) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        default :
            {
                goto process_error;
            }
    }

process_error:

	return error;
}

int fprint_key_init_callback(struct key *k, void *arg1, void *arg2, void *arg3)
{
    FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;
    FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data = arg1;
    FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data = arg2;
    u16 key_id = *(u16 *)arg3 + FPRINT_TEMPLATE_OFFSET;
    if (k->head.key_type == KEY_TYPE_FPRINT) {
        rt_memset(req_data, 0, sizeof(*req_data));
        rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_down_char.buf_id = 1;
        error = fprint_frame_process(FPRINT_FRAME_CMD_DOWN_CHAR, req_data, rep_data);
        if (error != FPRINT_EOK)
            return error;
		fprint_frame_send_data(&k->data,512);
        /*
        // get fprint template from rambuf0
        rt_memset(req_data, 0, sizeof(*req_data));
        rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_up_char.buf_id = 1;
        error = fprint_frame_process(FPRINT_FRAME_CMD_UP_CHAR,
                                        req_data, rep_data);
        if (error == FPRINT_EOK) {
            u8 buf[512];
            fprint_frame_recv_data(buf, 512);
            print_hex(buf, 512);
        }
        */
		// store fprint template to template_id
		rt_memset(req_data, 0, sizeof(*req_data));
		rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_store_char.buf_id = 1;
		reverse(req_data->req_store_char.template_id, (uint8_t *)&key_id, sizeof(key_id));
		error = fprint_frame_process(FPRINT_FRAME_CMD_STORE_CHAR, req_data, rep_data);

		//if (error != FPRINT_EOK)
		//    return error;
    }
    return error;
}

static FPRINT_ERROR_TYPEDEF
fprint_init(uint8_t *buf, FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data, FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{
//	uint16_t i;
	FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;
    uint32_t pw = FPRINT_FRAME_PW;
    uint32_t addr = FPRINT_FRAME_ADDR;
//	KEY_TYPEDEF key;
	// test connection
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
    reverse(req_data->req_verify.pw, (uint8_t *)&pw, sizeof(pw));
	error = fprint_frame_process(FPRINT_FRAME_CMD_VERIFY, req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;

	// delete all template
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	error = fprint_frame_process(FPRINT_FRAME_CMD_EMPTY, req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;
	// set ADDR
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
    reverse(req_data->req_set_addr.addr, (uint8_t *)&addr, sizeof(addr));
	error = fprint_frame_process(FPRINT_FRAME_CMD_SET_ADDR, req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;
	// set package size
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	req_data->req_set_param.type = 6;
	req_data->req_set_param.data = 2;
	error = fprint_frame_process(FPRINT_FRAME_CMD_SET_PARAM, req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;
    error = (FPRINT_ERROR_TYPEDEF)device_config_key_index(fprint_key_init_callback, req_data, rep_data);

	return error;
}

static FPRINT_ERROR_TYPEDEF
fprint_enroll(uint8_t *buf, FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data, FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{

	FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;

	// get fprint image
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	error = fprint_frame_process(FPRINT_FRAME_CMD_GET_IMAGE,
                                    req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;

