bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
                                //data.lock.key_id = template_id - FPRINT_TEMPLATE_OFFSET;
                                //data.lock.operation = GATE_UNLOCK;
                                //send_local_mail(ALARM_TYPE_LOCK_PROCESS, 0, &data);
                                if(fprintf_ok_fun != RT_NULL)
                                {
                                    FPINTF_USER key;

                                    key.KeyPos = template_id - FPRINT_TEMPLATE_OFFSET;
                                    rt_kprintf("key pos : %d\n", key.KeyPos);
                                    fprintf_ok_fun((void *)&key);
                                }
                            }
                            if (rep_data.rep_search.result == 0x09) {
                                RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint verify is no search\n"));
                                if(fprintf_error_fun != RT_NULL)
                                {
                                    FPINTF_USER key;

                                    key.KeyPos = 0xffff;
                                    fprintf_error_fun((void *)&key);
                                }
                            }
                        }
                        if (error == FPRINT_ENO_DETECTED) {
                            RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint verify is no detected\n"));
                            if(fprintf_null_fun != RT_NULL)
                            {
                                fprintf_null_fun(RT_NULL);
                            }
                        }
                        if (error == FPRINT_ERESPONSE || error == FPRINT_EERROR) {
                            if (r_detect++ > 1000) {
                                RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint has no response or error, may be fault!\n"));
                                fprint_init(buf, &req_data, &rep_data);
                                r_detect = 0;
                            }
                        } else {
                            r_detect = 0;
                        }
                        break;
					}
				default :
					{
                        RT_DEBUG_LOG(FPRINT_DEBUG, ("the finger print cmd is invalid!\n"));
						break;
					}
			}
            if (fprint_mail.result != RT_NULL)
                *fprint_mail.result = error;
            else
                *fprint_mail.result = FPRINT_EOK;
            if (fprint_mail.flag && fprint_mail.result_sem != RT_NULL) {
                rt_sem_release(fprint_mail.result_sem);
            }
		}
		else // time out
		{

        }

	}
}

static FPRINT_ERROR_TYPEDEF
send_fp_mail(FPRINT_CMD_TYPEDEF cmd, uint16_t *key_id, uint8_t *buf, uint16_t size, uint8_t flag)
{
	FPRINT_MAIL_TYPEDEF mail;
	rt_err_t result;
	FPRINT_ERROR_TYPEDEF error;
	if (fprint_mq != RT_NULL)
	{
        if (flag) {
            mail.result_sem = rt_sem_create("s_fp", 0, RT_IPC_FLAG_FIFO);
            RT_ASSERT(mail.result_sem != RT_NULL);
        } else {
            mail.result_sem = RT_NULL;
        }
        mail.result = &error;
		mail.cmd = cmd;
		mail.key_id = key_id;
        mail.size = size;
        mail.buf = buf;
        mail.flag = flag;
		result = rt_mq_send(fprint_mq, &mail, sizeof(mail));
		if (result == -RT_EFULL)
		{
            RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint_mq is full!!!\n"));
		}
		else
		{
            if (flag && (mail.result_sem != RT_NULL))
                rt_sem_take(mail.result_sem, RT_WAITING_FOREVER);
            RT_DEBUG_LOG(FPRINT_DEBUG, ("send result is %d\n", *mail.result));
		}

	}
	else
	{
        RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint_mq is null!!!\n"));
	}
    if (flag && (mail.result_sem != RT_NULL))
        rt_sem_delete(mail.result_sem);
	return error;
}

static int
rt_fprint_init(void)
{
	rt_thread_t fprint_thread;

    //initial fprint msg queue
	fprint_mq = rt_mq_create("fprint", sizeof(FPRINT_MAIL_TYPEDEF),
							 FPRINT_MAIL_MAX_MSGS, RT_IPC_FLAG_FIFO);
    if (fprint_mq == RT_NULL)
        return -1;

    s_fprint = rt_sem_create("s_fprint", 0, RT_IPC_FLAG_FIFO);

    // finger print thread
	fprint_thread = rt_thread_create("fprint", fprint_thread_entry,
									 RT_NULL, 3000, 100, 5);
	if (fprint_thread == RT_NULL)
        return -1;

    rt_thread_startup(fprint_thread);
    return 0;
}

INIT_APP_EXPORT(rt_fprint_init);

int
fp_init(void)
{
    int result = -1;

    if (send_fp_mail(FPRINT_CMD_INIT, RT_NULL, RT_NULL, 0, 1) == FPRINT_EOK)
        result = 0;

    return result;
}

static char enroll_flag = 0;

int
fp_enroll(uint16_t *key_id, uint8_t *buf, uint32_t timeout)
{
    rt_err_t error;
    int result = -1;
    int i;
    RT_ASSERT(key_id != RT_NULL);

    enroll_flag = 1;
    error = rt_sem_take(s_fprint, timeout);
    if (error == RT_EOK) {
        for (i = 0; i < 100; ++i) {
            if (gpio_pin_input(DEVICE_NAME_FP_TOUCH, 0) == FP_TOUCH_STATUS) {
                result = send_fp_mail(FPRINT_CMD_ENROLL, key_id, buf, 0, 1);
                if (result != FPRINT_EERROR)
                    break;
            } else {
                rt_thread_delay(10);
            }
        }
    }
    enroll_flag = 0;
    return result;
}

int
fp_get_template(uint8_t *buf, uint32_t timeout)
{
    rt_err_t error;
    int result = -1;

    enroll_flag = 1;
    error = rt_sem_take(s_fprint, timeout);
    if (error == RT_EOK) {
        if (send_fp_mail(FPRINT_CMD_GET_TEMPLATE, RT_NULL, buf, 0, 1) == FPRINT_EOK)
            result = 1;
    }
    
    enroll_flag = 0;
    return result;
}

int
fp_store_template(const uint16_t key_id, uint8_t *buf, uint32_t timeout)
{
    int result = -1;
    if (send_fp_mail(FPRINT_CMD_STORE_TEMPLATE, (uint16_t *)&key_id, buf, 0, 1) == FPRINT_EOK)
        result = key_id;
    return result;
}

int
fp_delete(const uint16_t key_id, const uint16_t size)
{
    int result = -1;

    if (send_fp_mail(FPRINT_CMD_DELETE, (uint16_t *)&key_id, RT_NULL, size, 1) == FPRINT_EOK)
        result = key_id;
    return result;
}

int
fp_verify(void)
{
    int result = -1;
    int i;
    
    for (i = 0; i < 100; ++i) {
        if (gpio_pin_input(DEVICE_NAME_FP_TOUCH, 0) == FP_TOUCH_STATUS) {
            result = send_fp_mail(FPRINT_CMD_VERIFY, RT_NULL, RT_NULL, 0, 1);
            if (result == FPRINT_EOK)
                break;
        } else {
            rt_thread_delay(10);
        }
    }
    
    return result;
}

void
fp_inform(void)
{
    if (enroll_flag)
        rt_sem_release(s_fprint);
    else
        fp_verify();
}

int
fp_up_char(uint16_t key_id)
{

    int result = -1;
    if (send_fp_mail(FPRINT_CMD_UP_CHAR, (uint16_t *)&key_id, RT_NULL, 0, 1) == FPRINT_EOK)
        result = 0;
    return result;
}
#ifdef RT_USING_FINSH
#include <finsh.h>

void fp_enroll_test(u16 timeout)
{
    uint16_t key_id;
    uint8_t buf[512];
    if (fp_enroll(&key_id, buf, timeout) >= 0) {
        rt_kprintf("key_id = %d\n--------------------\n", key_id);
        print_hex(buf, 512);
    } else {
        rt_kprintf("fprint enroll timeout\n");
    }
}

FINSH_FUNCTION_EXPORT(fp_init, fp_init[void]);
FINSH_FUNCTION_EXPORT(fp_enroll_test, fp_enroll_test[timeout]);
FINSH_FUNCTION_EXPORT(fp_delete, fp_delete[uint16]);
FINSH_FUNCTION_EXPORT(fp_verify, fp_verify[void]);
FINSH_FUNCTION_EXPORT(fp_inform, fp_inform[void]);
FINSH_FUNCTION_EXPORT_ALIAS(fp_up_char, fp_uchar, fp_up_char[key_id]);
#endif // RT_USING_FINSH
